[
  {
    "id": 5,
    "month": "january",
    "date": "19",
    "cover": "real-sociedad-barcelona",
    "title": "Real Sociedad 2-1 FC Barcelona",
    "subtitle": "25 shots, five onto the woodwork, are not enough to avoid a luckless loss in San Sebastian",
    "category": "first team",
    "relatedPlayers": [],
    "content": [
      {
        "id": "p1",
        "type": "paragraph",
        "text": "FC Barcelona have suffered an unlucky 2-1 defeat at Real Sociedad, despite dominating large parts of the game and having no fewer than five shots hit the woodwork. A first half goal from Mikel Oyarzabal and a second from Alexander Isak either side of a Ferran Torres equaliser were enough to give the Basques all three points on a frustrating night for the Liga leaders."
      },
      {
        "id": "p2",
        "type": "paragraph",
        "text": "Barça had 25 shots in total, with 10 on target, but were unable to find a way past Álex Remiro, who made a number of fine saves to keep his side in the game. The result means that Barça’s lead at the top of the table is down to just two points, with Atlético Madrid now just a single point behind them having played a game less."
      },
      {
        "id": "h1",
        "type": "heading",
        "level": 2,
        "text": "Oyarzabal puts Sociedad ahead"
      },
      {
        "id": "p3",
        "type": "paragraph",
        "text": "Hansi Flick made three changes to the side that beat Racing Santander in the Copa del Rey on Tuesday, with Raphinha, Pedri and Frenkie de Jong coming in for Marcus Rashford, Robert Lewandowski and Gavi."
      },
      {
        "id": "p4",
        "type": "paragraph",
        "text": "Barça started strongly and had the first chance of the game when Raphinha’s cross found Ferran Torres, whose header was well saved by Remiro. But Sociedad soon settled and took the lead on 22 minutes. A long ball forward found Mikel Oyarzabal, who controlled it well before firing a low shot past Joan García from just inside the box."
      },
      {
        "id": "p5",
        "type": "paragraph",
        "text": "Barça responded well and almost equalised straight away. A fine run from Pedri down the left saw him cut inside and unleash a powerful shot that crashed against the post. The rebound fell to Frenkie de Jong, whose effort was again well saved by Remiro."
      }
    ]
  },
  {
    "id": 4,
    "month": "january",
    "date": "16",
    "cover": "racing-barcelona-round-of-16",
    "title": "Racing Santander 0-2 FC Barcelona: Into the last eight",
    "subtitle": "Goals from Ferran Torres and Lamine Yamal seal a hard-fought win at the home of the leaders of the second division",
    "category": "first team",
    "relatedPlayers": [],
    "content": [
      {
        "id": "p1",
        "type": "paragraph",
        "text": "And indeed this was anything but a simple ride. With just Ferran Torres’ second half goal splitting the sides, Racing Santander pressed hard for an equaliser and came close on a number of occasions before Lamine Yamal settled things once and for all with a goal in the dying seconds of injury time."
      },
      {
        "id": "p2",
        "type": "paragraph",
        "text": "It was so refreshing to see that a historic side like Racing are back on track after several years in the doldrums, but ultimately there is no doubt that, not without a tough fight, the best side won today and the defending champions will be among the eight teams going into the quarter final draw."
      },
      {
        "id": "h1",
        "type": "heading",
        "level": 2,
        "text": "Hard work"
      },
      {
        "id": "p3",
        "type": "paragraph",
        "text": "Hansi Flick opted to start without such favourites as Lewandowski, Raphinha, Pedri and Eric García, but with a top-of-table clash with Las Palmas coming up at the weekend, the home side also included a few rotations."
      },
      {
        "id": "p4",
        "type": "paragraph",
        "text": "Racing weren’t afraid to take the game to Barça, but quickly realised these things are easier said than done against the Liga leaders, and got forced more and more into a defence and counter attack game. However, it soon became apparent that the Cantabrians are impressively adept at both of those tasks, and the minutes ticked by with Barça always threatening but creating alarmingly little in the way of clear-cut chances."
      },
      {
        "id": "p5",
        "type": "paragraph",
        "text": "Jokin Ezkieta’s gloves may have still been surprisingly clean at half-time, but Barça upped the ante after the interval and the likes of Lamine Yamal and Marcus Rashford were soon putting the Racing keeper to the test."
      },
      {
        "id": "h2",
        "type": "heading",
        "level": 2,
        "text": "Torres breaks deadlock"
      },
      {
        "id": "p6",
        "type": "paragraph",
        "text": "Barça pushed, pushed and pushed a bit more, to the point that pretty much all the action was in the opposition’s half of the pitch. But buoyed by a vibrant El Sardinero, Racing dug deep in defence, often spectacularly, making Barça work a lot harder than they have done this season against supposedly superior sides."
      },
      {
        "id": "p7",
        "type": "paragraph",
        "text": "There was a reason Racing weren’t going forward. Their first meaningful attack of the second half gave Barça the space they needed and when Fermín López played Ferran Torres through on goal, there was no way the ‘Shark’ was going let the chance slip."
      },
      {
        "id": "p8",
        "type": "paragraph",
        "text": "A sweet little finish and after 66 minutes of frustration, Barça were at last on top!"
      },
      {
        "id": "p9",
        "type": "paragraph",
        "text": "Racing now had no option but to throw caution to the wind, and Manex Lozano did indeed get the ball in the back of Joan García’s net not once but twice, but on both occasions play was called back for offside."
      },
      {
        "id": "h3",
        "type": "heading",
        "level": 2,
        "text": "Lamine seals it"
      },
      {
        "id": "p10",
        "type": "paragraph",
        "text": "Logic still said that Barça were going to go on to win this, but Racing were playing with such grit and passion that an equaliser and extra time were far from out of the question. And in the dying seconds of injury time it looked like they had it. But Lozano went for the shot rather than laying up the unmarked Andrés Martínat at his side. A superb block by Joan García and moments later Lamine Yamal was scoring the goal that settled the game once and for all."
      },
      {
        "id": "p11",
        "type": "paragraph",
        "text": "It looked like the forwards had wasted a fine chance on the counter attack, but Raphinha eventually cleared things up by setting up a last second tap-in for the man who had initiated the move."
      },
      {
        "id": "p12",
        "type": "paragraph",
        "text": "Cracking drama to end a lovely little cup tie in Cantabria, and Barça will go on from this to meet one of Real Sociedad, Athletic Club, Atlético Madrid, Real Betis, Alavés, Albacete or Valencia in the next round."
      },
      {
        "id": "s1",
        "type": "slider",
        "images": [
          {
            "src": "slider-1",
            "alt": "Racing vs Barcelona Copa del Rey round of 16"
          },
          {
            "src": "slider-2",
            "alt": "Racing vs Barcelona Copa del Rey round of 16"
          },
          {
            "src": "slider-3",
            "alt": "Racing vs Barcelona Copa del Rey round of 16"
          },
          {
            "src": "slider-4",
            "alt": "Racing vs Barcelona Copa del Rey round of 16"
          },
          {
            "src": "slider-5",
            "alt": "Racing vs Barcelona Copa del Rey round of 16"
          },
          {
            "src": "slider-6",
            "alt": "Racing vs Barcelona Copa del Rey round of 16"
          },
          {
            "src": "slider-7",
            "alt": "Racing vs Barcelona Copa del Rey round of 16"
          },
          {
            "src": "slider-8",
            "alt": "Racing vs Barcelona Copa del Rey round of 16"
          }
        ]
      }
    ]
  },
  {
    "id": 3,
    "month": "january",
    "date": "12",
    "cover": "supercopa-winner",
    "title": "FC Barcelona 3-2 Real Madrid",
    "subtitle": "Two goals from Raphinha and won from Lewandowski deliver the 16th Spanish Super Cup on a memorable night in Jeddah",
    "category": "first team",
    "relatedPlayers": [],
    "content": [
      {
        "id": "p1",
        "type": "paragraph",
        "text": "FC Barcelona have retained the Spanish Super Cup trophy after yet another Clásico that fully delivered on the promise of being the greatest club fixture in the world."
      },
      {
        "id": "p2",
        "type": "paragraph",
        "text": "After tournament MVP Raphinha had opened the scoring, there were no fewer three goals in first half injury time, with the sides going for the break level pegging on 2-2. Barça had played the better football of the first half, and a second Raphinha goal with just over a quarter of hour to go would turn out to be the winner, but not without plenty of further drama between then and the final whistle."
      },
      {
        "id": "p3",
        "type": "paragraph",
        "text": "On a night in Saudi Arabia that also saw Ronald Araujo make a welcome return to action, and also be honoured as the man chosen to lift the trophy, Barça have become the first back-to-back Super Cup winners for a decade and a half, and have extended what was already a record haul of wins in this competition to 16."
      },
      {
        "id": "m1",
        "type": "media",
        "media": {
          "type": "image",
          "src": "raphinha-celebrate",
          "alt": "Raphinha Super Cup"
        }
      },
      {
        "id": "h1",
        "type": "heading",
        "level": 2,
        "text": "Brazilians at both ends"
      },
      {
        "id": "p4",
        "type": "paragraph",
        "text": "After an opening half hour with little in the way of major action, the game swung into action big time with no fewer than four goals before the first half was over."
      },
      {
        "id": "p5",
        "type": "paragraph",
        "text": "Having just missed one great chance running in from the left, Raphinha made no mistake when presented with a similar opportunity just moments later and Barça were ahead."
      },
      {
        "id": "p6",
        "type": "paragraph",
        "text": "The goal inflated Barça as much as it deflated their opposition, and Real Madrid were largely chasing shadows as the Catalans dominated possession (76% in the first 45 minutes) and kept Thibaut Courtois busy as they pressed hard in search of a second."
      },
      {
        "id": "p7",
        "type": "paragraph",
        "text": "A Madrid equaliser looked highly unlikely at this stage, but that’s what we got two minutes into injury time. With all due respect, it was a flash of genius from Vinícius Júnior. The Brazilian skipped his way through five defenders before converting and we were back to all square."
      },
      {
        "id": "h2",
        "type": "heading",
        "level": 2,
        "text": "Injury time madness"
      },
      {
        "id": "p8",
        "type": "paragraph",
        "text": "Barça were quick to respond. Extraordinarily quick. Practically from the restart, the Madrid defence was caught napping as Pedri played through to Robert Lewandowski, and the Pole deftly flicked the ball over Courtois and in off the far post. The Madrid players were furious that the goal had come after the three minutes of injury time were clearly up, but they weren’t complaining when they themselves also scored before the half-time whistle blew."
      },
      {
        "id": "p9",
        "type": "paragraph",
        "text": "Dean Huijsen headed a corner onto the crossbar and Gonzalo García managed to scramble the rebound over the line. Following a crazy few minutes of football, it was 2-2 at the break."
      },
      {
        "id": "h3",
        "type": "heading",
        "level": 2,
        "text": "Raphinha does it again!"
      },
      {
        "id": "p10",
        "type": "paragraph",
        "text": "Barça weren’t quite as dominant after the restart, but on 73 minutes they were ahead for the third time. There was an element of fortune as Raphinha’s shot deflected upward off Raúl Asencio and over a confounded Courtois’ head. But into the net it went, making the Brazilian the first player to ever score four goals in a single edition of the Super Cup. Barça’s intentions shifted from trying to extend their lead to simply protecting it as the game built up to a thrilling climax."
      },
      {
        "id": "p11",
        "type": "paragraph",
        "text": "Kylian Mbappé, fresh back from injury, came on to help Madrid’s quest to get a goal back, but the Frenchman’s only major impact on the game was to be on the receiving end of a tackle that looked a lot worse than it really was, but for which Frenkie de Jong nevertheless saw red."
      },
      {
        "id": "h4",
        "type": "heading",
        "level": 2,
        "text": "Late heroics"
      },
      {
        "id": "p12",
        "type": "paragraph",
        "text": "Madrid’s fightback had produced little in the way of real chances, and substitute Marcus Rashford could have settled things once and for all at the other end, before two glorious saves from Joan García ensured that blaugrana ribbons were going on the trophy. There was a terrifying moment when any number of Madrid players could have shot from close range, but it was Álvaro Carreras who eventually did, and then the Barça stopper blocked a point-blank header from Asencio, just seconds before the final whistle blew on a breathtaking game of football and heralded FC Barcelona as the Spanish Super Cup winners for the second year in a row!"
      },
      {
        "id": "s1",
        "type": "slider",
        "images": [
          {
            "src": "slider-1",
            "alt": "Barcelona vs Real Madrid"
          },
          {
            "src": "slider-2",
            "alt": "Barcelona vs Real Madrid"
          },
          {
            "src": "slider-3",
            "alt": "Barcelona vs Real Madrid"
          },
          {
            "src": "slider-4",
            "alt": "Barcelona vs Real Madrid"
          },
          {
            "src": "slider-5",
            "alt": "Barcelona vs Real Madrid"
          },
          {
            "src": "slider-6",
            "alt": "Barcelona vs Real Madrid"
          }
        ]
      }
    ]
  },
  {
    "id": 2,
    "month": "january",
    "date": "9",
    "cover": "barca-records",
    "title": "Five records from a perfect semifinal against Athletic Club",
    "subtitle": "Barça's 5-0 win over Athletic Club saw the team set several records in the Spanish Super Cup",
    "category": "first team",
    "relatedPlayers": [""],
    "content": [
      {
        "id": "p1",
        "type": "paragraph",
        "text": "his wasn't just any old victory. The five goals against Athletic Club in the Spanish Super Cup semi-final produced several records and provided interesting facts that will help to remember a perfect match by the blaugranes in Yeddah."
      },
      {
        "id": "h1",
        "type": "heading",
        "level": 2,
        "text": "Super Cup history made"
      },
      {
        "id": "p2",
        "type": "paragraph",
        "text": "To begin with, the match will go into the history books as the first ever to be won by a five goal margin in the competition. It was also the first time a team had gone in four goals up at half-time (4-0)."
      },
      {
        "id": "h2",
        "type": "heading",
        "level": 2,
        "text": "35 years later..."
      },
      {
        "id": "p3",
        "type": "paragraph",
        "text": "It's also 35 years since Barça scored a total of nine goals across two consecutive games against Athletic Club, which was back in the 1990/91 season. The day of the return to the Spotify Camp Nou on 22 November saw Barça also win big against the Basque side (4-0)."
      },
      {
        "id": "h3",
        "type": "heading",
        "level": 2,
        "text": "Fermín, Ferran and Roony make their mark"
      },
      {
        "id": "p4",
        "type": "paragraph",
        "text": "Fermín López, Ferran Torres and Roony Bardghji are also likely to remember the match in Yeddah. The Andalusian scored and assisted in the first half of the game, a first for the competition. Ferran and Roony also scored their first goals in the competition."
      },
      {
        "id": "h4",
        "type": "heading",
        "level": 2,
        "text": "Four Super Cup debuts"
      },
      {
        "id": "p5",
        "type": "paragraph",
        "text": "In fact, Roony and another three players made their debuts in the Spanish Super Cup. The others were Marcus Rashford, Marc Bernal and Joan Garcia, the latter ensuring Barça have now achieved five consecutive clean sheets for the first time since 2020."
      },
      {
        "id": "h5",
        "type": "heading",
        "level": 2,
        "text": "100 goals in the competition"
      },
      {
        "id": "p6",
        "type": "paragraph",
        "text": "The final goal by Raphinha to make it 5-0 was goal number 100 for Barça in the Spanish Super Cup. They also lead the way for highest ever goalscorers in the competition with the 14 goals by Leo Messi."
      },
      {
        "id": "m1",
        "type": "media",
        "media": {
          "type": "image",
          "src": "barca-records-2",
          "alt": "Barcelona vs Athletic Club"
        }
      }
    ]
  },
  {
    "id": 1,
    "month": "january",
    "date": "8",
    "cover": "barca-athletic-semi-final",
    "title": "FC Barcelona 5-0 Athletic Club: Super finalists",
    "subtitle": "Ferran, Fermín, Roony and Raphinha (2) get the goals as Hansi Flick's side surge into Sunday's final",
    "category": "first team",
    "relatedPlayers": [""],
    "content": [
      {
        "id": "p1",
        "type": "paragraph",
        "text": "FC Barcelona have blitzed their way into Sunday’s Spanish Super Cup Final (kick-off 8pm CET) with a simply staggering 5–0 victory over Athletic Club. A colossal Raphinha struck twice, with Ferran Torres, Fermín López and Roony Bardghji also on target — four of the goals coming in the first 38 minutes, rendering the second half little more than a formality."
      },
      {
        "id": "p2",
        "type": "paragraph",
        "text": "The biggest winning margin in the competition’s history perfectly reflected what unfolded on the pitch. Barça were utterly dominant from start to finish, while their opponents barely laid a glove on them. It was certainly an uncharacteristically poor showing from the Basques, but that owed much to the brilliance of a Barça side that seems to improve with every outing. On this occasion, the blaugranes were simply out of this world."
      },
      {
        "id": "h1",
        "type": "heading",
        "level": 2,
        "text": "Ferran opens the floodgates"
      },
      {
        "id": "p3",
        "type": "paragraph",
        "text": "Had it not been for a handful of solid interventions from Athletic goalkeeper Unai Simón, Barça could have been ahead well before they eventually broke the deadlock on 22 minutes. It remains unclear whether Fermín’s volley was intended as a shot or a pass, but Ferran Torres made no mistake on the end of it, turning sharply and firing home from close range with trademark precision."
      },
      {
        "id": "p4",
        "type": "paragraph",
        "text": "Barça were even more dominant after scoring and it wasn’t long before they’d doubled their lead."
      },
      {
        "id": "p5",
        "type": "paragraph",
        "text": "Bang on the half-hour Raphinha capped a strong run down the left with a simply perfect pass through the Basque defence to meet Fermín running in. The 22-year-old couldn’t have asked for a better connection and that was 2-0."
      },
      {
        "id": "p6",
        "type": "paragraph",
        "text": "Athletic already looked like a beaten team and there was still an hour of football to play. And things were about to get worse for them. Much worse. Barça were on a roll."
      },
      {
        "id": "h2",
        "type": "heading",
        "level": 2,
        "text": "Ferran opens the floodgates"
      },
      {
        "id": "p7",
        "type": "paragraph",
        "text": "Just four minutes later, Roony had a pop from an angle. It was a speculative attempt that shouldn’t have troubled Unai too much, but the ball slipped under the keeper's body and across the line."
      },
      {
        "id": "p8",
        "type": "paragraph",
        "text": "This was no longer a game. It was a rout. By the time the teams went in for the break, Barça had done it again. And what a goal from man-of-the-match Raphinha! The Brazilian swept onto Ronny’s pass, unleashed a thunderbolt into the top left corner and that was 4-0."
      },
      {
        "id": "p9",
        "type": "paragraph",
        "text": "Oihan Sancet struck the post before the whistle blew, but even if it had gone in, Athletic already knew they were fighting a losing battle. This game had blaugrana written all over it. Culers could already start making plans for Sunday’s final."
      },
      {
        "id": "h3",
        "type": "heading",
        "level": 2,
        "text": "Eyes on the final"
      },
      {
        "id": "p10",
        "type": "paragraph",
        "text": "And there was more to come. The second half had barely started before the goal count was up to five. A series of blocked attempts eventually led to the ball landing at the feet of somebody who already had six goals from six games. Raphinha is in insatiable form, and that was yet another for his collection."
      },
      {
        "id": "p11",
        "type": "paragraph",
        "text": "The only question fans were asking now was how many more Barça could score. But with a final to be played on Sunday and absolutely no need to overdo things, they kept things sensible, eased off the accelerator and the second half passed off with very little more in the way of major incident."
      },
      {
        "id": "p12",
        "type": "paragraph",
        "text": "It didn’t need to. The celebrations had already begun long before the final whistle put Athletic out of their agony. A simply majestic Barça are staying a little bit longer in Jeddah, and all that remains is to find out whether it’s Real or Atlético Madrid who stand between them and the trophy."
      },
      {
        "id": "m1",
        "type": "media",
        "media": {
          "type": "image",
          "src": "barca-athletic",
          "alt": "Barça vs Athletic Club"
        }
      }
    ]
  },
  {
    "id": 0,
    "month": "july",
    "date": "14",
    "cover": "roony-bardghji",
    "title": "Roony Bardghji signs for FC Barcelona until 2029",
    "subtitle": "Swedish player joins from FC Copenhagen and is set to stay until 30 June 2029",
    "category": "transfers",
    "relatedPlayers": ["bardghji"],
    "content": [
      {
        "id": "p1",
        "type": "paragraph",
        "text": "FC Barcelona and FC Copenhagen have reached agreement for the transfer of the player Roony Bardghji. The winger is to sign a contract with the club for four seasons until 30 June 2029."
      },
      {
        "id": "h1",
        "type": "heading",
        "level": 2,
        "text": "Young talent for the right wing"
      },
      {
        "id": "mt1",
        "type": "media-text",
        "order": "text-first",
        "media": {
          "type": "image",
          "src": "roony-2",
          "alt": "Roony Bardghji",
          "width": 170,
          "height": 200
        },
        "text": "Just four minutes later, Roony had a pop from an angle. It was a speculative attempt that shouldn’t have troubled Unai too much, but the ball slipped under the keeper's body and across the line."
      },
      {
        "id": "p2",
        "type": "paragraph",
        "text": "Signed from FC Copenhagen, Bardghji joined the youth system at the Danish side in summer 2020, after starting out at Malmö. His talent saw him quickly promoted to the Copenhagen first team in 2022, going on to play 84 games, scoring 15 goals and providing one assist."
      },
      {
        "id": "mt2",
        "type": "media-text",
        "order": "media-first",
        "media": {
          "type": "image",
          "src": "roony-2",
          "alt": "Roony Bardghji",
          "width": 170,
          "height": 200
        },
        "text": "This was no longer a game. It was a rout. By the time the teams went in for the break, Barça had done it again. And what a goal from man-of-the-match Raphinha! The Brazilian swept onto Ronny’s pass, unleashed a thunderbolt into the top left corner and that was 4-0."
      },
      {
        "id": "h2",
        "type": "heading",
        "level": 2,
        "text": "Young talent for the right wing"
      },
      {
        "id": "p3",
        "type": "paragraph",
        "text": "As a wide player, Bardghji is known for his one-on-one skills, his ability to dribble past opponents, and his effectiveness in front of goal. His presence on the right wing can, therefore, make the difference and provide more dynamism. During his spell for Copenhagen, he won three Danish league titles and two Danish cups, making decisive contributions for team success."
      },
      {
        "id": "m1",
        "type": "media",
        "media": {
          "type": "image",
          "src": "roony-1",
          "alt": "Roony Bardghji"
        }
      }
    ]
  }
]
